#include <stdio.h> 
#include <locale.h>
 
void name()
{
    puts("*******************************************\n*                                         *\n* тема: Разработка консольного приложения *\n*      Выполнил Баркалов И.А.             *\n*                                         *\n*******************************************");

}

void date()
{
    puts("   _      _    _     ");
    puts("| |_   |  _|  | | |_|");
    puts("| |_|  | |_   |_|   |");
}

int main()  
{ 
    setlocale(LC_ALL, "ru_RU.CP1251"); 
    puts("Моя программа");
    puts("Hello world!");

    puts("Нажмите Enter для продолжения...");
    getchar();
    puts("Продолжение программы");

    puts(" _     _  _       _   _  _   _   _ ");
    puts("| | |  _| _| |_| |_  |_   | |_| |_|");
    puts("|_| | |_  _|   |  _| |_|  | |_|  _|");

    date();
    name();
} 
